service/updateservice-ws/src/test/resources/dk/dbc/validateservice/ws/single_record.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:open="http://oss.dbc.dk/ns/openCatalogingValidate"
                  xmlns:dat="http://oss.dbc.dk/ns/openCataloging/DataContracts">
    <soapenv:Header/>
    <soapenv:Body>
        <open:validate>
            <open:validateRequest>
                <dat:validateSchema>bog</dat:validateSchema>
                <dat:bibliographicalRecord>
                    <dat:recordSchema>info:lc/xmlns/marcxchange-v1</dat:recordSchema>
                    <dat:recordPacking>xml</dat:recordPacking>
                    <dat:recordData>
                        <sru:collection
                            xsi:schemaLocation="info:lc/xmlns/marcxchange-v1 http://www.loc.gov/standards/iso25577/marcxchange-1-1.xsd"
                            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:sru="info:lc/xmlns/marcxchange-v1">
                            <sru:record>
                                <sru:datafield tag="001">
                                    <sru:subfield code="a">2 017 106 5</sru:subfield>
                                    <sru:subfield code="b">870970</sru:subfield>
                                    <sru:subfield code="c">12072013</sru:subfield>
                                    <sru:subfield code="d">12072013101735</sru:subfield>
                                    <sru:subfield code="f">a</sru:subfield>
                                </sru:datafield>
                                <sru:datafield tag="004">
                                    <sru:subfield code="a">e</sru:subfield>
                                    <sru:subfield code="r">n</sru:subfield>
                                </sru:datafield>
                            </sru:record>
                        </sru:collection>
                    </dat:recordData>
                    <!--Optional:-->
                    <dat:extraRecordData>
                        cum
                        <!--You may enter ANY elements at this point-->
                        sonoras
                    </dat:extraRecordData>
                </dat:bibliographicalRecord>
                <!--Optional:-->
                <dat:trackingId>42</dat:trackingId>
            </open:validateRequest>
        </open:validate>
    </soapenv:Body>
</soapenv:Envelope>
